import numpy as np

# شتاب گرانش زمین (m/s^2)
g = 9.81

# مشخصات هواپیما Gulfstream G550
aircraft = {

    # جرم برخاست هواپیما (kg)
    "mass": 41277,

    # مساحت بال (m^2)
    "S": 105.63,

    # دهانه بال (m)
    "b": 27.69,

    # مجموع تراست دو موتور (N)
    "thrust": 136800,

    # ضریب پسا پسماند
    "CD0": 0.02,

    # فاکتور اسوالد 
    "e": 0.85,

    # حداکثر ضریب برا
    "CLmax": 2.6,

    # محدودیت ضریب بار مثبت
    "n_limit_pos": 2.5,

    # محدودیت ضریب بار منفی
    "n_limit_neg": -1,

    # سرعت شیرجه طراحی (m/s)
    "VD": 300
}

# محاسبه نسبت منظری بال
def aspect_ratio():

    # AR = b^2 / S
    return aircraft["b"]**2 / aircraft["S"]
