import numpy as np

# مدل استاندارد اتمسفر ISA
def isa_atmosphere(h):

    # دمای سطح دریا (کلوین)
    T0 = 288.15

    # فشار سطح دریا (پاسکال)
    P0 = 101325

    # نرخ کاهش دما با ارتفاع
    L = 0.0065

    # ثابت گاز هوا
    R = 287

    # شتاب گرانش
    g = 9.81

    # ضریب گرمایی هوا
    gamma = 1.4

    # محاسبه دما در ارتفاع
    T = T0 - L*h

    # محاسبه فشار
    P = P0*(T/T0)**(g/(R*L))

    # محاسبه چگالی
    rho = P/(R*T)

    # سرعت صوت
    a = np.sqrt(gamma*R*T)

    return T, P, rho, a
